Update vale and rewrites
Signed-off-by: Rae Sharp <resharp20@gmail.com>
